Extensions/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПолученоНаличными</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>AzRyАналитикаКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>AzRyЭлектроннаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплатыПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоммерОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Консультант</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Консультант</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>24</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/Enums/СтатусыПартий/СтатусыПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПартий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СобственныеЗапасы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветственноеХранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДавальческоеСырье</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТоварыНаКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/ЧекККМ/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЧекККМЗапасы.Ссылка КАК Ссылка,
	|	ЧекККМЗапасы.Ссылка КАК Документ,
	|	ЧекККМЗапасы.Ссылка.Дата КАК Дата,
	|	ЧекККМЗапасы.Заказ КАК ЗаказПокупателя,
	|	ЧекККМЗапасы.Ссылка.КассаККМ КАК КассаККМ,
	|	ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный,
	|	ЧекККМЗапасы.Ссылка.КассаККМ.Владелец КАК КассаККМВладелец,
	|	ЧекККМЗапасы.Ссылка.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ЧекККМЗапасы.Ссылка.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	ЧекККМЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	&Организация КАК Организация,
	|	ЧекККМЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекККМЗапасы.Ссылка.Подразделение КАК Подразделение,
	|	ЧекККМЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЧекККМЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЧекККМЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК СчетУчетаВыручкиОтПродаж,
	|	ЧекККМЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК СчетУчетаСебестоимость,
	|	ЧекККМЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
	|	ЧекККМЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК СчетУчетаСебестоимостьРегл,
	|	НЕОПРЕДЕЛЕНО КАК Ячейка,
	|	ЧекККМЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
	|	ЧекККМЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаЗапасовРегл,
	|	ЧекККМЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл, //Малышев 2024-12-06 ONESOFT-3670
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|				И ЧекККМЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТоварыНаКомиссии,
	|	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЧекККМЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ЧекККМЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекККМЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЧекККМЗапасы.Количество
	|		ИНАЧЕ ЧекККМЗапасы.Количество * ЧекККМЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЧекККМЗапасы.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ЧекККМЗапасы.СуммаНДС * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ЧекККМЗапасы.СуммаНДС * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ЧекККМЗапасы.Всего * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ЧекККМЗапасы.СуммаНДС КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
	|	ВЫРАЗИТЬ(ЧекККМЗапасы.Всего КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ЧекККМЗапасы.КлючСвязи,
	|	НЕОПРЕДЕЛЕНО КАК КоррСтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК КоррНоменклатура,
	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаЗапасовРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЧекККМЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ЧекККМЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПартия,
	|	ЧекККМЗапасы.Ссылка.КассоваяСмена КАК КассоваяСмена,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекККМЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЧекККМЗапасы.Резерв
	|		ИНАЧЕ ЧекККМЗапасы.Резерв * ЧекККМЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Резерв,
	|	ЧекККМЗапасы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	
	//Малышев 2024-10-23 ONESOFT-3536 (--
	|	ВЫБОР
	|		КОГДА ЧекККМЗапасы.Ссылка.Контрагент <> Значение(Справочник.Контрагенты.ПустаяСсылка) 
	|			ТОГДА ЧекККМЗапасы.Ссылка.Контрагент
	|		ИНАЧЕ  ISNULL(УчетнаяПолитикаРегл.РозничныйКонтрагент,Значение(Справочник.Контрагенты.ПустаяСсылка))
	|    КОНЕЦ КАК Контрагент,
	//Малышев 2024-10-23 ONESOFT-3536 --)
	
	|	ВЫБОР
	|		КОГДА ЧекККМЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ЧекККМЗапасы.Всего - ЧекККМЗапасы.СуммаНДС) * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЧекККМЗапасы.Сумма * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ЧекККМЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА ЧекККМЗапасы.Всего - ЧекККМЗапасы.СуммаНДС
	|		ИНАЧЕ ЧекККМЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДСВал,
	|	ВЫРАЗИТЬ(ЧекККМЗапасы.Количество * ЧекККМЗапасы.Цена КАК ЧИСЛО(15, 2)) КАК СуммаБезСкидки
	//// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	//// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	//|	,ВЫБОР
	//|		КОГДА не &УчетПоПроектам ТОГДА Значение(Справочник.Проекты.ПустаяСсылка) //Малышев 2024-12-06 ONESOFT-3670
	//|		КОГДА &УчетПоПроектам
	//|			ТОГДА ВЫБОР
	////|					КОГДА ЧекККМЗапасы.Заказ = Значение(Документ.ЗаказПокупателя.ПустаяССылка)   //Малышев 2024-12-06 ONESOFT-3670
	//|					КОГДА ЧекККМЗапасы.Заказ = Значение(Документ.ЗаказПокупателя.ПустаяССылка) и УчетнаяПолитикаРегл.РозничныйПроект<>Значение(Справочник.Проекты.ПустаяСсылка) //Малышев 2025-06-11 ONESOFT-3828
	//|						ТОГДА УчетнаяПолитикаРегл.РозничныйПроект                                //Малышев 2024-12-06 ONESOFT-3670
	//|					КОГДА ЧекККМЗапасы.Заказ.Проект ЕСТЬ NULL
	//|							ИЛИ ЧекККМЗапасы.Заказ.Проект = НЕОПРЕДЕЛЕНО
	//|							ИЛИ ЧекККМЗапасы.Заказ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|					ИНАЧЕ ЧекККМЗапасы.Заказ.Проект
	//|				КОНЕЦ
	//|	КОНЕЦ КАК Проект
	//// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	//// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ЧекККМЗапасы.Ссылка.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ЧекККМЗапасы.Ссылка.КассаККМ.AzRyПроект КАК Проект
	//|	,ЧекККМЗапасы.Ссылка.Контрагент КАК Контрагент
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыДокВалюты
	|		ПО ЧекККМЗапасы.Ссылка.ВалютаДокумента = КурсыДокВалюты.Валюта
	//Малышев 2024-10-23 ONESOFT-3536 (--
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&МоментВремени, Организация=&Организация) КАК УчетнаяПолитикаРегл
	|		ПО ЧекККМЗапасы.Ссылка.Организация = УчетнаяПолитикаРегл.Организация
	//Малышев 2024-10-23 ONESOFT-3536 --)
	
	|ГДЕ
	|	ЧекККМЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧасть.Ссылка.Дата КАК Дата,
	|	&Ссылка КАК Документ,
	|	&Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка.КассаККМ КАК КассаККМ,
	|	ТабличнаяЧасть.Ссылка.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ТабличнаяЧасть.Ссылка.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	ТабличнаяЧасть.Ссылка.ЭквайринговыйТерминал.СчетУчетаРегл КАК ЭквайринговыйТерминалСчетУчетаРегл,
	|	ТабличнаяЧасть.Ссылка.ЭквайринговыйТерминал.СчетУчета КАК ЭквайринговыйТерминалСчетУчета,
	|	ТабличнаяЧасть.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Сумма * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ТабличнаяЧасть.Сумма КАК СуммаВал,
	|	ТабличнаяЧасть.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|	ТабличнаяЧасть.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	ТабличнаяЧасть.Ссылка.ЭквайринговыйТерминал.Эквайрер КАК Эквайрер,
	|	ТабличнаяЧасть.Ссылка.ЭквайринговыйТерминал.Договор КАК Договор,
	|	ТабличнаяЧасть.Ссылка.ЭквайринговыйТерминал
	|ПОМЕСТИТЬ ВременнаяТаблицаОплатаПлатежнымиКартами
	|ИЗ
	|	Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТабличнаяЧасть.Ссылка.ВалютаДокумента = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМСкидкиНаценки.КлючСвязи,
	|	ЧекККМСкидкиНаценки.СкидкаНаценка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЧекККМСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ЧекККМСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ЧекККМСкидкиНаценки.Сумма * КурсыУпрВалюты.Кратность / КурсыУпрВалюты.Курс
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ЧекККМСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ЧекККМСкидкиНаценки.Ссылка.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
	|ИЗ
	|	Документ.ЧекККМ.СкидкиНаценки КАК ЧекККМСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА),
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|ГДЕ
	|	ЧекККМСкидкиНаценки.Ссылка = &Ссылка
	|	И ЧекККМСкидкиНаценки.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты,
	|	МАКСИМУМ(ЭквайринговыеТерминалыВидыПлатежныхКарт.ПроцентКомиссии) КАК ПроцентКомиссии
	|ПОМЕСТИТЬ ВременнаяТаблицаПроцентыКомиссии
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
	|ГДЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка = &ЭквайринговыйТерминал
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяСерийныеНомера.КлючСвязи,
	|	РасходнаяНакладнаяСерийныеНомера.СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ЧекККМ.СерийныеНомера КАК РасходнаяНакладнаяСерийныеНомера
	|ГДЕ
	|	РасходнаяНакладнаяСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЧекККМ);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ДокументСсылкаЧекККМ.ЭквайринговыйТерминал);
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	
	Запрос.ВыполнитьПакет();
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ЧекККМ(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	// Щербакво ---
			
	
	СформироватьТаблицаКонтрольСроковГодностиТовара1(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);

	//
	//Если  СтруктураДополнительныеСвойства.ИспользоватьКонтрольСроковГодностиТовара  и 
	//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.свойство("ТаблицаЗапасыНаСкладах") Тогда 
	//	ТзЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах;
	//	СформироватьТаблицаКонтрольСроковГодностиТовара(ДокументСсылкаЧекККМ, ТзЗапасы);//lazare 07.11.2022
	//КонецЕсли;
	
	
	// ДисконтныеКарты
	СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	// АвтоматическиеСкидки
	СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	// Эквайринг
	СформироватьТаблицаОплатаПлатежнымиКартами(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
	// Заказы покупателей в розничной торговле
	СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
	// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	СформироватьТаблицаРезервированиеЗапасов(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства); // Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	
КонецПроцедуры 

&Вместо("СформироватьТаблицаДоходыИРасходы")
Процедура РасшAzRy_СформироватьТаблицаДоходыИРасходы(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	0 КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Дата КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродаж КАК СчетУчета,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаРегл,
	
	//Малышев 2024-10-23 ONESOFT-3536
	//|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	ТаблицаДоходыИРасходы.Контрагент КАК Аналитика,
	//Малышев 2024-10-23 ONESOFT-3536
	
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	////|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	//|	ТаблицаДоходыИРасходы.Контрагент КАК Аналитика,
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК Сумма
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаДоходыИРасходы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ТаблицаДоходыИРасходы.Проект КАК Проект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И &ЧекПробит
	|	И НЕ &Архивный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Дата,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.Подразделение,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.Контрагент, //Малышев 2024-10-23 ONESOFT-3536
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродаж,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродажРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаДоходыИРасходы.AzRyАналитикаКонтрагент,
	|	ТаблицаДоходыИРасходы.Проект
	//|	ТаблицаДоходыИРасходы.Контрагент
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,NULL
	|	,NULL
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
	|ГДЕ
	|	&ЧекПробит
	|	И НЕ &Архивный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов';en='income'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ЧекПробит", СтруктураДополнительныеСвойства.ДляПроведения.ЧекПробит);
	Запрос.УстановитьПараметр("Архивный", СтруктураДополнительныеСвойства.ДляПроведения.Архивный);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
		
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
		
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&Вместо("СформироватьТаблицаЗапасы")
Процедура РасшAzRy_СформироватьТаблицаЗапасы(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
		
	// Ставим в резерв только то количество, которое ещё не поставлено в резерв заказом покупателя на складе розничной точки!
	// Окончательное снятие резерва с заказа происходит в документе "Отчет о розничных продажах".
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [13 октября 2021 г.]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);
	// © Шишка В.В. [13 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ТаблицаЗапасы.Документ КАК ДокументПродажи,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПродажи,
	|	ТаблицаЗапасы.Подразделение КАК Подразделение,
	|	ТаблицаЗапасы.Ответственный КАК Ответственный,
	|	ТаблицаЗапасы.Подразделение КАК ПодразделениеПродажи,
	|	ТаблицаЗапасы.ТоварыНаКомиссии КАК ТоварыНаКомиссии,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [14 октября 2021]  НАЧАЛО
	//|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
	|	ВЫБОР КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА ТОГДА НЕОПРЕДЕЛЕНО 
	|   ИНАЧЕ ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|   КОНЕЦ КАК СтруктурнаяЕдиница,
	// © Шишка В.В. [14 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасов КАК КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл КАК КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	Неопределено КАК ДокументПоступления, //Малышев 2024-12-06 ONESOFT-3670
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Резерв,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК СуммаНДС,
	|	0 КАК Сумма,
	|	0 КАК Себестоимость,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетКт,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК Содержание,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	ЛОЖЬ КАК Резервирование
	|	,ТаблицаЗапасы.Проект КАК Проект // Kuzmich, 31.10.2024 
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment: 
	|	,ТаблицаЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент
	//|	,ТаблицаЗапасы.AzRyПроект КАК AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment: 	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК ФункциональнаяОпцияРезервированиеЗапасов
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (&ЧекПробит
	|			ИЛИ &ТоварЗарезервирован)
	|	И НЕ &Архивный
	|	И НЕ &ДвиженияПоЗапасамУдалять
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Дата,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.Подразделение,
	|	ТаблицаЗапасы.Ответственный,
	|	ТаблицаЗапасы.НаправлениеДеятельности,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасов,
	|	ТаблицаЗапасы.ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.ТипНоменклатуры,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.КоррПартия,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.Подразделение,
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	|	,ТаблицаЗапасы.Проект
	
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасы.AzRyАналитикаКонтрагент,
	//|	ТаблицаЗапасы.AzRyПроект,
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ТаблицаЗапасы.СчетУчетаСебестоимость";
	
	Запрос.УстановитьПараметр("УчетПоПроектам",  СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	// Kuzmich, 31.10.2024, (ONESOFT-3535) Чек ККМ и РМК - добавить движение расход по новом регистре
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	Запрос.УстановитьПараметр("ЧекПробит", СтруктураДополнительныеСвойства.ДляПроведения.ЧекПробит);
	Запрос.УстановитьПараметр("ТоварЗарезервирован", СтруктураДополнительныеСвойства.ДляПроведения.ТоварЗарезервирован);
	Запрос.УстановитьПараметр("Архивный", СтруктураДополнительныеСвойства.ДляПроведения.Архивный);
	Запрос.УстановитьПараметр("ДвиженияПоЗапасамУдалять", СтруктураДополнительныеСвойства.ДляПроведения.ДвиженияПоЗапасамУдалять);
	Запрос.УстановитьПараметр("ИспользоватьЗаказыВРозничнойТорговле", ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
	
	//Малышев 2024-12-06 ONESOFT-3670 ((-
	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства).Выгрузить(); 
	
	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
	
	Для каждого СтрокаТаблицаЗапасы из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы Цикл
		
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);
		
		КоличествоТребуетсяСвободныйОстаток = СтрокаТаблицаЗапасы.Количество;
		
		МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			Для каждого СтрокаТаблицыОстатков из МассивСтрокОстатков Цикл
				
				Если КоличествоТребуетсяСвободныйОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;	
				
				КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток;
				СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток;
				
				КоличествоКСписанию = 0;
				СуммаКСписанию = 0;
				
				Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
					
					КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток; 
					СуммаКСписанию = Окр(СуммаОстаток * КоличествоКСписанию / КоличествоОстаток , 2, 1);
					
					СтрокаТаблицыОстатков.КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток - КоличествоКСписанию;
					СтрокаТаблицыОстатков.СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток - СуммаКСписанию;
					
				ИначеЕсли КоличествоОстаток <= 0 Тогда  
					Продолжить;
					
				//ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
				ИначеЕсли КоличествоОстаток >0 и КоличествоОстаток <= КоличествоТребуетсяСвободныйОстаток Тогда  //Малышев 2024-11-19 ONESOFT-3602
					
					СуммаКСписанию = СуммаОстаток;  
					//++Lazare 11.02.2025 ONESOFT-3832
					Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда 
						КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток; 
					Иначе  
					//--Lazare 11.02.2025 ONESOFT-3832	
						КоличествоКСписанию = КоличествоОстаток; 
					КонецЕсли;
					
					СтрокаТаблицыОстатков.КоличествоОстаток = 0;
					СтрокаТаблицыОстатков.СуммаОстаток = 0;
					
				Иначе
					СуммаКСписанию = 0; 
					
				КонецЕсли;
				
				КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоКСписанию; //Малышев 2024-11-19 ONESOFT-3602

				// Расход. Запасы.
				СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицыРасход.Сумма = СуммаКСписанию;
				СтрокаТаблицыРасход.Количество = КоличествоКСписанию;
				СтрокаТаблицыРасход.Себестоимость = СуммаКСписанию;
				
				СтрокаТаблицыРасход.ДокументПоступления = СтрокаТаблицыОстатков.ДокументПоступления; //Малышев 2024-11-19 ONESOFT-3602
				
			КонецЦикла;	
		КонецЕсли;		
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = ВременнаяТаблицаЗапасы;

	//Малышев 2024-12-06 ONESOFT-3670  --)
	
	
	
	
	
	СформироватьТаблицаЗапасыПродажа(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

&Вместо("СформироватьТаблицаЗапасыНаСкладах")
Процедура РасшAzRy_СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ЧекККМЗапасы.Дата КАК Период,
	|	ЧекККМЗапасы.Организация КАК Организация,
	|	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|	ЧекККМЗапасы.Характеристика КАК Характеристика,
	|	ЧекККМЗапасы.Партия КАК Партия,
	|	ЧекККМЗапасы.Проект КАК Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ЧекККМЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ЧекККМЗапасы.Количество) КАК Количество
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	//|	,ЧекККМЗапасы.AzRyПроект КАК AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ЧекККМЗапасы
	|ГДЕ
	|	ЧекККМЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (&ЧекПробит
	|			ИЛИ &ТоварЗарезервирован)
	|	И (НЕ &Архивный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМЗапасы.НомерСтроки,
	|	ЧекККМЗапасы.Дата,
	|	ЧекККМЗапасы.Организация,
	|	ЧекККМЗапасы.Номенклатура,
	|	ЧекККМЗапасы.Характеристика,
	|	ЧекККМЗапасы.Партия,
	|	ЧекККМЗапасы.Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ЧекККМЗапасы.СтруктурнаяЕдиница
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	//|	,ЧекККМЗапасы.AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЧекККМ);
	Запрос.УстановитьПараметр("ЧекПробит", СтруктураДополнительныеСвойства.ДляПроведения.ЧекПробит);
	Запрос.УстановитьПараметр("ТоварЗарезервирован", СтруктураДополнительныеСвойства.ДляПроведения.ТоварЗарезервирован);
	Запрос.УстановитьПараметр("Архивный", СтруктураДополнительныеСвойства.ДляПроведения.Архивный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&Вместо("СформироватьТаблицаПродажи")
Процедура РасшAzRy_СформироватьТаблицаПродажи(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Дата КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Контрагент КАК Контрагент, //Малышев 2024-10-23 ONESOFT-3536
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.Подразделение КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	0 КАК Себестоимость
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаПродажи.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ТаблицаПродажи.Проект КАК Проект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|ГДЕ
	|	&ЧекПробит
	|	И (НЕ &Архивный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Дата,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ЗаказПокупателя,
	|	ТаблицаПродажи.Контрагент, //Малышев 2024-10-23 ONESOFT-3536
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.Подразделение,
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	ТаблицаПродажи.AzRyАналитикаКонтрагент,
	|	ТаблицаПродажи.Проект,
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ТаблицаПродажи.Ответственный";
	
	Запрос.УстановитьПараметр("ЧекПробит", СтруктураДополнительныеСвойства.ДляПроведения.ЧекПробит);
	Запрос.УстановитьПараметр("Архивный", СтруктураДополнительныеСвойства.ДляПроведения.Архивный);
	
	РезультатЗапроса = Запрос.Выполнить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
